//Напишите программу, которая на вход принимает два числа и выдаёт, какое число большее, а какое меньшее.
int numberA = 1;
Console.Write(numberA);
